In [1]:
import pandas as pd

In [2]:
pd

In [3]:
df = pd.read_csv("data.csv")

In [14]:
df.fillna(0, inplace=True)
df

   id    name   age  salary
0   1     Ali  25.0   50000
1   2    Sara  31.0   62000
2   3   Usman  29.0   54000
3   4  Ayesha  35.0   70000
4   5  Hassan   0.0   58000
5   6    Zara  31.0   62000
6   7   Imran  42.0   80000
7   8    Nida  38.0   72000

In [8]:
df["age"]

0    25.0
1    31.0
2    29.0
3    35.0
4     NaN
5    31.0
6    42.0
7    38.0
Name: age, dtype: float64

In [9]:
df["salary"]

0    50000
1    62000
2    54000
3    70000
4    58000
5    62000
6    80000
7    72000
Name: salary, dtype: int64

In [10]:
df["name"]

0       Ali
1      Sara
2     Usman
3    Ayesha
4    Hassan
5      Zara
6     Imran
7      Nida
Name: name, dtype: object

In [12]:
age_mean = df["age"].mean()
print("mean of age is", age_mean)

mean of age is 33.0

In [16]:
salary_mean = df["salary"].mean()
print("mean of salary is", salary_mean)

mean of salary is 63500.0

In [17]:
age_median = df["age"].median()
print("median of age is ", age_median)

median of age is  31.0

In [18]:
salary_median = df["salary"].median()
print("median of salary is ",salary_median)

median of salary is  62000.0

In [19]:
age_mode = df["age"].mode()
print("mode of salary is ", age_mode)

mode of salary is  0    31.0
Name: age, dtype: float64

In [20]:
salary_mode = df["salary"].mode()
print("mode of salary",salary_mode)

mode of salary 0    62000
Name: salary, dtype: int64